<?php

class SampleController extends AppController {
	public $defaultAction = 'List';		//  デフォルトのアクション
	public $disableAction = [ 'Page', 'Find' ];	// 無視するアクション

//===============================================================================
// モジュールクラスではコンストラクタを定義しない
//  必要なら ClassInit() メソッドで初期化する
//===============================================================================
//	クラス初期化処理
	protected function ClassInit() {
	}
//===============================================================================
// 必要なメソッドアクションをオーバーライド定義する
//  AppControllerにはごく基本的な
//  List/Page/Find/View/Update アクションのみが定義されている
//===============================================================================
/*
	public function ListAction() {
		parent::ListAction();
	}
*/
}
